// pages/audio/audio.js
Page({
  num:0,
  data:{
    nowPlay:{
      id: 1,
      poster: 'http://jafish.online/audio/img/jinlichao.jpg',
      name: '锦鲤抄',
      author: '银临/云の泣',
      src: 'http://jafish.online/audio/music/jinlichao.mp3'
    },
    scrollHeight:0,
    Lyric:'欢迎来到音乐频道',
    lyricAll:'',
    musicList:[
      {
        id: 1,
        poster: 'http://jafish.online/audio/img/jinlichao.jpg',
        name: '锦鲤抄',
        author: '银临/云の泣',
        src: 'http://jafish.online/audio/music/jinlichao.mp3'
      },
      {
        id: 2,
        poster: 'http://jafish.online/audio/img/changanyi.jpg',
        name: '长安忆',
        author: '双笙',
        src: 'http://jafish.online/audio/music/changanyi.mp3'
      },
      {
        id: 3,
        poster: 'http://jafish.online/audio/img/qiansixi.jpg',
        name: '牵丝戏',
        author: '银临/aki阿杰',
        src: 'http://jafish.online/audio/music/qiansixi.mp3'
      },
      {
        id: 4,
        poster: 'http://jafish.online/audio/img/shanshuizhijian.jpg',
        name: '山水之间',
        author: '许嵩',
        src: 'http://jafish.online/audio/music/shanshuizhijian.mp3'
      },
      {
        id: 5,
        poster: 'http://jafish.online/audio/img/shuangxueqiannian.jpg',
        name: '霜雪千年',
        author: '萧忆情',
        src: 'http://jafish.online/audio/music/shuangxueqiannian.mp3'
      }]
  },
  onLoad:function(options){
    // 页面初始化 options为页面跳转所带来的参数
    var that = this;
    
    
    wx.getSystemInfo({
      success: function(res) {
        //console.log(res.windowHeight)
        that.setData({scrollHeight:res.windowHeight-260});
        //console.log(that.data.scrollHeight)
      }
    });

    
  },
  onReady: function (e) {
    // 使用 wx.createAudioContext 获取 audio 上下文 context
    this.audioCtx = wx.createAudioContext('myAudio');
    
    this.lyricRun();
  },
  playMusic: function(e){
    var that = this;
    //console.log(e)
    var index = e.target.dataset.idx;
    //console.log(index);
    if(index != undefined){
      this.setData({
        nowPlay:this.data.musicList[index],
        Lyric:'欢迎来到音乐频道'
      });

      setTimeout(function(){
        that.lyricRun();
        that.audioCtx.play();
      },500)
      
    }
  },
  endMusic:function () {
    var that = this;
    var num = 0;
    var id = this.data.nowPlay.id;

    if(id >= this.data.musicList.length){
      num = 0;
    }else{
      num = id;
    }

    this.setData({
      nowPlay:this.data.musicList[num],
      Lyric:'欢迎来到音乐频道'
    });
    setTimeout(function(){
        that.lyricRun();
        that.audioCtx.play();
      },500)
  },
  funtimeupdate: function(e){
    //console.log(u.detail.currentTime);
    var currentTime = parseInt(e.detail.currentTime);
    this.setData({Lyric:this.data.lyricAll[currentTime]});
  },
  lyricRun:function(){
    function parseLyric(lrc) {
      var lyrics = lrc.split("\n");
      var lrcObj = {};
      for(var i=0;i<lyrics.length;i++){
          var lyric = decodeURIComponent(lyrics[i]);
          var timeReg = /\[\d*:\d*((\.|\:)\d*)*\]/g;
          var timeRegExpArr = lyric.match(timeReg);
          if(!timeRegExpArr)continue;
          var clause = lyric.replace(timeReg,'');
          for(var k = 0,h = timeRegExpArr.length;k < h;k++) {
              var t = timeRegExpArr[k];
              var min = Number(String(t.match(/\[\d*/i)).slice(1)),
                  sec = Number(String(t.match(/\:\d*/i)).slice(1));
              var time = min * 60 + sec;
              lrcObj[time] = clause;
          }
      }
      return lrcObj;
    }

    var id = 'id' + this.data.nowPlay.id;

    //console.log(id)
    this.setData({lyricAll:parseLyric(lyric[id])});
    //console.log(this.data.lyricAll)
  }
})





var lyric = {
  "id1":`[ti:锦鲤抄]
[ar:银临]
[al:2013年4月网络红歌3]
[offset:0]
[00:11.64]锦鲤抄-银临
[00:12.94]作词：慕清明
[00:14.26]作曲：银临
[00:15.89]
[00:33.49]蝉声陪伴着行云流浪
[00:37.54]回忆开始后安静遥望远方
[00:41.56]荒草覆没的古井枯塘
[00:45.75]匀散一缕过往
[00:49.19]
[00:49.75]晨曦惊扰了陌上新桑
[00:53.95]风卷起庭前落花穿过回廊
[00:58.07]浓墨追逐着情绪流淌
[01:02.20]染我素衣白裳
[01:06.69]
[01:07.56]阳光微凉 琴弦微凉
[01:11.74]风声疏狂 人间仓皇
[01:15.86]呼吸微凉 心事微凉
[01:20.04]流年匆忙 对错何妨
[01:24.78]你在尘世中辗转了千百年
[01:28.97]却只让我看你最后一眼
[01:33.18]火光描摹容颜燃尽了时间
[01:37.12]别留我一人 孑然一身
[01:41.54]凋零在梦境里面
[01:45.60]
[02:02.32]萤火虫愿将夏夜遗忘
[02:05.98]如果终究要挥别这段时光
[02:09.97]裙袂不经意沾了荷香
[02:14.10]从此坠入尘网
[02:17.46]
[02:18.27]屐齿轻踩着烛焰摇晃
[02:22.36]所有喧嚣沉默都描在画上
[02:26.41]从惊蛰一路走到霜降
[02:30.60]泪水凝成诗行
[02:35.09]
[02:36.09]灯花微凉 笔锋微凉
[02:39.71]
[02:40.21]难绘虚妄 难解惆怅
[02:44.28]梦境微凉 情节微凉
[02:48.39]迷离幻象 重叠忧伤
[02:52.33]
[02:53.14]原来诀别是因为深藏眷恋
[02:57.38]你用轮回换我枕边月圆
[03:01.50]我愿记忆停止在枯瘦指尖
[03:05.55]随繁花褪色 尘埃散落
[03:09.98]渐渐地渐渐搁浅
[03:14.48]多年之后 我又梦到那天
[03:21.59]
[03:22.27]画面遥远 恍惚细雨绵绵
[03:30.23]如果来生太远寄不到诺言
[03:34.42]不如学着放下许多执念
[03:38.53]以这断句残篇向岁月吊唁
[03:42.60]老去的当年 水色天边
[03:47.03]有谁将悲欢收殓
[03:50.87]蝉声陪伴着行云流浪
[03:55.06]回忆的远方`,
  "id2":`[ti:长安忆]
[ar:音频怪物]
[al:]
[by:鬼目草]
[00:01.18]长安忆 
[00:05.05]词：枕衣de糖罐唲 
[00:12.05]曲：武部聪志<かざぐるま> 唱：音频怪物
[00:22.32]长安雨，一夜落秋意
[00:27.79]路千里，朔风吹客衣
[00:33.55]江船夜雨听笛，倚晚晴
[00:39.42]平沙漠漠兮愁无际
[00:44.86]长安堤，垂杨送别离
[00:50.41]千山月，一片伤心碧
[00:56.13]长门又误佳期，声清凄
[01:02.06]朱颜染尘兮梦中语
[01:07.07]。。。
[01:10.16]二十三弦急，落花人独立
[01:16.06]惟有此曲能寄心中意
[01:21.42]月落子规啼，飞絮衔霜去
[01:27.17]然诺重，只愿君从此记
[01:32.15]。。。
[01:44.17]长安去，辞家三千里
[01:49.61]涯无垠，却问愁几许
[01:55.53]试剑更须钟吕，伴君起
[02:01.12]风渡萧萧兮烟迷离
[02:06.83]长安居，陇头谁吹笛
[02:12.35]灯花落，瘦尽又一夕
[02:17.88]醉乡路隐难行，风露清
[02:23.96]君向潇湘兮我向秦
[02:28.80]。。。
[02:55.40]
[02:32.12]醉笑三千席，不诉离别意，惟有此曲能忘人间景
[03:05.16]
[02:43.31]年华落丹青，一片碧空洗，知音稀，弦断有谁来听
[03:20.59]落日孤城闭，燕然归无计
[03:25.77]惟有此曲能解断肠情
[03:31.39]边声连角起，人去无留意
[03:37.00]羌管难续，悠悠霜满地
[03:42.78]去留两无意，停云杯难息
[03:48.42]此曲声成，自有身后名
[03:54.05]长安忆，重楼倚城隅
[03:59.58]陌上雪，沉醉复又醒
[04:05.29]早知如此相遇，不如不遇
[04:11.17]笙歌歇尽兮人散去
[04:18.08]长安忆`,
  "id3" : `[ti:牵丝戏]
[ar:银临&Aki阿杰]
[al:]
[00:01.75]牵丝戏
[00:03.89]作曲：银临
[00:06.44]编/混：灰原穷
[00:09.53]填词：Vagary
[00:12.40]演唱：银临&Aki阿杰
[00:16.08]海报：苏澈白
[00:18.77]
[00:23.65]银临：嘲笑谁恃美扬威 没了心如何相配
[00:34.50]盘铃声清脆 帷幕间灯火幽微
[00:40.20]我和你 最天生一对
[00:44.95]
[00:46.25]没了你才算原罪 没了心才好相配
[00:56.84]你褴褛我彩绘 并肩行过山与水
[01:02.45]你憔悴 我替你明媚
[01:07.21]
[01:08.21]是你吻开笔墨 染我眼角珠泪
[01:13.70]演离合相遇悲喜为谁
[01:19.00]他们迂回误会 我却只由你支配
[01:24.72]问世间哪有更完美
[01:29.37]
[01:30.18]Aki：兰花指捻红尘似水
[01:35.68]三尺红台 万事入歌吹
[01:41.25]唱别久悲不成悲 十分红处竟成灰
[01:47.21]愿谁记得谁 最好的年岁
[01:52.80]
[02:14.72]银临：你一牵我舞如飞 你一引我懂进退
[02:25.95]苦乐都跟随 举手投足不违背
[02:31.68]将谦卑 温柔成绝对
[02:36.63]
[02:37.42]你错我不肯对 你懵懂我蒙昧
[02:42.88]心火怎甘心扬汤止沸
[02:48.14]你枯我不曾萎 你倦我也不敢累
[02:53.98]用什么暖你一千岁
[02:58.78]
[02:59.28]Aki：风雪依稀秋白发尾
[03:27.21]
[03:04.96]灯火葳蕤 揉皱你眼眉
[03:32.64]
[03:10.47]假如你舍一滴泪 假如老去我能陪
[03:38.67]
[03:16.45]烟波里成灰 也去得完美
[03:21.53]风雪依稀秋白发尾
[03:56.29]`,
  "id4" : `[ti:山水之间]
[ar:许嵩]
[al:]
[00:00.00]山水之间
[00:03.15]
[00:04.51]词曲：许嵩
[00:06.91]演唱：许嵩
[00:09.92]制作人、编曲：许嵩
[00:10.63]古筝：程皓如
[00:11.28]竹笛：赵晓姝
[00:11.98]二胡：尚祖建
[00:12.61]电吉他：高飞
[00:13.50]
[00:32.79]
[00:38.66]昨夜同门云集
[00:40.27]推杯又换盏
[00:44.04]今朝茶凉酒寒
[00:45.82]豪言成笑谈
[00:49.65]半生累 尽徒然
[00:52.43]碑文完美有谁看
[00:55.43]隐居山水之间
[00:57.43]誓与浮名散
[00:59.66]
[01:04.17]湖畔青石板上
[01:06.09]一把油纸伞
[01:10.06]旅人停步折花
[01:11.83]淋湿了绸缎
[01:15.49]满树玉瓣多傲然
[01:18.29]江南烟雨却痴缠
[01:21.69]花飞雨追一如尘缘理还乱
[01:25.81]
[01:27.21]落花雨
[01:28.81]你飘摇的美丽
[01:32.74]花香氤
[01:34.60]把往日情勾起
[01:38.51]我愿意
[01:40.38]化浮萍躺湖心
[01:44.32]只陪你
[01:46.09]泛岁月的涟漪
[01:48.90]
[02:16.67]古木檀香小筑
[02:18.26]经文诵得缓
[02:21.92]锦服华裳一炬
[02:24.19]粗袖如心宽
[02:27.65]林中抚琴曲委婉
[02:30.61]群山听懂我悲欢
[02:33.64]泪如雨落才知过往剪不断
[02:38.03]
[02:39.34]落花雨
[02:41.06]你飘摇的美丽
[02:44.96]花香氤
[02:46.81]把往日情勾起
[02:50.74]我愿意
[02:52.65]化浮萍躺湖心
[02:56.45]只陪你
[02:58.44]泛岁月的涟漪
[03:00.97]
[03:28.83]落花雨
[03:30.46]你飘摇的美丽
[03:34.18]花香氤
[03:36.04]把往日情勾起
[03:39.88]我愿意
[03:41.96]化浮萍躺湖心
[03:45.65]只陪你
[03:47.63]泛岁月的涟漪
[03:50.14]
[03:51.57]落花雨
[03:53.44]你飘摇在天地
[03:57.16]晚风急
[03:59.11]吹皱芳华太无情
[04:03.05]我愿意
[04:04.98]化流沙躺湖堤
[04:08.85]只陪你
[04:10.74]恭候春夏的轮替
[04:13.37]
[04:14.77]落花雨
[04:16.60]谁深藏山水里
[04:20.61]落花雨
[04:22.54]谁深藏在我心
[04:26.43]
[04:31.79]`,
  "id5" : `[00:01.17]霜雪千年
[00:02.52]作词：COP
[00:03.97]作曲：COP
[00:14.60]梨花香 缠着衣角掠过熙攘
[00:20.20]复悄入红帘深帐
[00:23.72]听枝头黄鹂逗趣儿
[00:25.78]细风绕指淌
[00:28.43]坐船舫 兰桨拨开雾霭迷茫
[00:34.05]不觉已一日过半
[00:37.39]过眼的葱郁风光
[00:39.54]悉数泛了黄
[00:42.32]褪尽温度的风
[00:44.48]无言牵引中
[00:45.93]便清晰了在此的眉目
[00:49.82]暮色的消融
[00:51.17]隐约了悔朔葱茏
[00:54.98]在这老街回眸
[00:57.89]烟云中追溯我是谁
[00:59.79]只消暮雨点滴
[01:01.24]便足以粉饰这是非
[01:03.09]待这月色涌起
[01:06.58]谁人轻叩着门扉
[01:09.89]苔绿青石板街
[01:11.39]斑驳了流水般岁月
[01:13.34]小酌三盏两杯
[01:14.84]理不清缠绕的情结
[01:16.91]在你淡漠眉间
[01:20.19]瞥见离人的喜悲霜雪
[01:37.02]楼阁现 尘飞雾散荧光翩跹
[01:42.63]显露出斑驳石阶
[01:46.01]入眼是落英纷然
[01:48.22]芳草入深院
[01:50.69]凭栏杆 小桌上置琼觞两盏
[01:56.24]阖眼听清风疏叶
[01:59.72]似曾有欢声笑言
[02:01.78]萦绕这高轩
[02:05.04]云动寂静鸣蝉
[02:06.59]雨坠激漪涟
[02:08.19]皴擦点染勾勒这世间
[02:11.96]缘起的一眼
[02:13.44]定格了三生千年
[02:17.13]在这老街回眸
[02:20.03]烟云中追溯我是谁
[02:22.13]只消暮雨点滴
[02:23.43]便足以粉饰这是非
[02:25.28]待这月色涌起
[02:28.77]谁人轻叩着门扉
[02:32.27]苔绿青石板街
[02:33.82]斑驳了流水般岁月
[02:35.72]小酌三盏两杯
[02:37.07]理不清缠绕的情结
[02:39.02]在你淡漠眉间
[02:42.45]瞥见离人的喜悲霜雪
[02:59.54]三月梨花雪 
[03:01.29]几载开了又败
[03:03.14]笔锋走黑白 
[03:04.69]丹青中穿插无奈
[03:06.49]彼时那弯儿月 
[03:08.21]何时初现于江畔
[03:10.22]而我又在待何人
[03:12.12]在这亭台回眸
[03:14.78]千年后忆起你是谁
[03:16.73]只消月色隐约
[03:18.23]便足以勾勒这是非
[03:20.13]待这回忆涌起
[03:23.79]恍惚之间已下泪
[03:26.57]枫红十里长街
[03:28.53]红帘后谁人蹙着眉
[03:30.43]遥梦桑竹桃源
[03:32.11]轮回中曾道别的地点
[03:34.17]愿今生再相见
[03:37.24]消融你眉间悲戚霜雪`
}

